# 3. Напишите код, который запрашивает число и сообщает, является ли оно простым или составным.
# Используйте правило для проверки:
# “Число является простым, если делится нацело только на единицу и на себя”.
# Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч.

while True:
    num = int(input("Введите целое число: "))
    if 0 <= num <= 100_000:
        break
    print("Число должно быть от 0 до 100 тысяч")

is_prime = True
for i in range(2, int(num**0.5)+1):
    if num % i == 0:
        is_prime = False
        break

if is_prime:
    print("Число простое")
else:
    print("Число составное")

